       01  AREC.
           05  AR-NO   PIC 9(8).
           05  AR-NM   PIC X(30).
           05  AR-BAL  PIC S9(13)V99 COMP-3.
           05  AR-ST   PIC X.
               88  AR-A    VALUE "A".
               88  AR-C    VALUE "C".
           05  AR-DT   PIC 9(8).
