       01  TREC.
           05  TR-ID   PIC 9(10).
           05  TR-AC   PIC 9(8).
           05  TR-TY   PIC X(3).
               88  T-DEP   VALUE "DEP".
               88  T-WDR   VALUE "WDR".
               88  T-TIN   VALUE "TIN".
               88  T-TOU   VALUE "TOU".
           05  TR-AM   PIC S9(13)V99 COMP-3.
           05  TR-BA   PIC S9(13)V99 COMP-3.
           05  TR-CP   PIC 9(8).
           05  TR-TS   PIC 9(14).
